while True:
    print("Выберите уровень:")
    print("1.")
    print("2.")
    print("3.")
    print("4.")
    print("5.")
    a = int(input("Ввод:"))
    if a == 1:
        print('На этом уровне вы можете изменить введеную строчку, вы можете:')
        print("1. Сделать первую буквы заглавной, а остальные строчными")
        print("2. Сделать всю строку строчными буквами")
        print("3. Сделать всю строчку заглвынми буквами")
        v = int(input("Выберите метод: "))
        s = input("Введите строчку: ")
        if v == 1:
            s = s.capitalize()
            print(s)
        if v == 2:
            s = s.lower()
            print(s)
        if v == 3:
            s = s.upper()
            print(s)
    if a == 2:
        print("На этом уровне вы сможете найти символ в строке, поменять символ и посчитать количество/букв слов в строке")
        print("1. Найти позицию первого вхождения символа")
        print('2. Введите символ/слово и элемент на который вы хотите заменить')
        print('3. Узнать количество букв/ слов в строке')
        v = int(input("Выберите метод: "))
        s = input("Введите строчку: ")
        if v == 1:
            o = input("Введите символ/слово которое хотите найти: ")
            print(s.find(o.lower()))
        if v == 2:
            o1 = input("Введите символ/слово, которое хотите заменить: ").lower()
            o2 = input("Ввежите то, на что вы хотите заменить: ")
            print(s.replace(o1, o2))
        if v == 3:
            o = input("Введите элемент/слово, чтобы узнать сколько раз оно встречается: ").lower()
            print(s.count(o.lower()))
    if a == 3:
        print("На этом уровне вы можете либо разделить строчку по определенному символу, либо вводить разные строчки и склеить их в одну")
        print("1. Разделить строку по определенному символу ")
        print("2. Сделать строчку из нескольких строк")
        v = int(input("Выберите метод: "))
        if v == 1:
            s = input("Введите строчку: ").lower()
            r = input("Выберите разделитель: ").lower()
            print(s.split(r))
        if v == 2:
            v = input("Введите строчку или введите 0 чтобы закончить ввод строчек: ")
            sp = []
            ot = ''
            while v != '0':
                v = input("Введите строчку или введите 0 чтобы закончить ввод строчек: ")
                sp.append(v)
            print(ot.join(sp[0: -2]))
    if a == 4:
        print("На это уровне вы можете проверить состоит ли строка только из чисел или символов, убрать лищние пробелы и вставить нужную информацию")
        print("1. Проверить состоит ли строка только из чисел ")
        print('2. Проверить состоит ли строка только и символов')
        print("3. Убрать лишние пробелы")
        print("4. Ввести информацию в специальные пропуски ({})")
        v = int(input(""))
        if v == 1:
            s = input("Введите строчку: ")
            if s.isdigit() == True:
                print("Строка состоит только из чисел")
            else:
                print("Строка состоит не только из чисел")
        if v == 2:
                    s = input("Введите строчку: ")
                    if s.isalpha() == True:
                        print("Строка состоит только из символов")
                    else:
                        print("Строка состоит не только из символов")
        if v == 3:
            s = input("Введите строчку: ")
            print(s.strip())
        if v == 4:
            pass